Revit 2027 API
AnalyticalEquipmentLoadData.PowerFactor Property
 The power factor of analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PowerFactor { get; set; }
Public Property PowerFactor As Double
	Get
	Set
public:
property double PowerFactor {
	double get ();
	void set (double value);
}
member PowerFactor : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for power factor must be between 0 and 1.
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace